ERP.belugaerp/src/Documents/битЗаявлениеОВыдачеФСМ/битЗаявлениеОВыдачеФСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битЗаявлениеОВыдачеФСМ</name>
  <comment>Заявление о выдаче ФСМ</comment>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальныйОрганРАР</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявления</name>
    <type>
      <types>EnumRef.бг_ТипыЗаявленийОВыдачеФСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>бг_АнализыДляУдостоверенияОКачестве</name>
    <type>
      <types>CatalogRef.бг_ТиповыеАнализыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Вариативность</name>
    <type>
      <types>CatalogRef.бг_ВариативностьНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидОперацииНалогообложенияАкцизом</name>
    <type>
      <types>CatalogRef.бг_ВидыОперацийНалогообложенияАкцизом</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Выбыл</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ГодУрожая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Добавлен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕК_СУМ</name>
    <type>
      <types>CatalogRef.бг_ЕК_СУМ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодНоменклатурыSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КонтрагентПроизводитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НормативныйДокумент</name>
    <type>
      <types>CatalogRef.бг_НормативныеДокументыСертификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОбменB2B</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОписаниеСоставаПродукта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновноеНаименование</name>
    <type>
      <types>CatalogRef.бг_ОсновныеНаименованияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Предшественник</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокГодности</name>
    <type>
      <types>CatalogRef.бг_ЕК_Номенклатура_СрокГодности</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокХраненияПробВЛабораторииМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Статус</name>
    <type>
      <types>EnumRef.бг_СтатусыНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтранаПроизводителя</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипИмпортныхССП</name>
    <type>
      <types>EnumRef.бг_ТипыИмпортныхССП</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипМарки</name>
    <type>
      <types>CatalogRef.бг_КлассификаторТиповМарок</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УсловияТранспортирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ФайлПиктограммы</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетПоГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаАналитическогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСрокаГодности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>бг_СпособыОбеспеченияПотребности</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОбеспеченияПотребностей</name>
      <type>
        <types>CatalogRef.СпособыОбеспеченияПотребностей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Documents/битЗаявлениеОВыдачеФСМ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&Вместо("ПриКопировании")
Процедура бг_ПриКопировании(ОбъектКопирования)
	
	Идентификатор           = "";
	ИдентификаторЕГАИС      = "";
	
КонецПроцедуры

&Вместо("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Идентификатор = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ИнтеграцияЕГАИСПереопределяемый.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

&Вместо("ПриЗаписи")
Процедура бг_ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ЗаписатьСтатусДокументаЕГАИСПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

&Вместо("ОбработкаПроведения")
Процедура бг_ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьУникальностьНоменклатуры(Отказ);
	ПроверитьВидАлкогольнойПродукции(Отказ);
	ПроверитьУникальностьВидаМаркиТипаАлкогольнойПродукции(Отказ)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьУникальностьНоменклатуры(Отказ)
	
	СтрокиНоменклатуры = Новый Соответствие;
	Дубли = Новый Массив;
	Для Каждого Товар Из Товары Цикл
		Если СтрокиНоменклатуры[Товар.Номенклатура] = Неопределено Тогда
			СтрокиНоменклатуры.Вставить(Товар.Номенклатура, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Товар.НомерСтроки));
		Иначе
			Дубли.Добавить(Товар.Номенклатура);
			СтрокиНоменклатуры[Товар.Номенклатура].Добавить(Товар.НомерСтроки)
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого Дубль Из Дубли Цикл
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(
				НСтр("ru = '%1 указан в нескольких строках:
				           |%2
				           |Введите эту номенклатуру одной строкой.'"),
				Дубль,
				СтрСоединить(СтрокиНоменклатуры[Дубль], ", ")),
			ЭтотОбъект,
			"Товары",,        
			Отказ);
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ПроверитьВидАлкогольнойПродукции(Отказ)
	
	ВидАлкогольнойПродукцииНомеклатуры = 
		ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
			Товары.ВыгрузитьКолонку("Номенклатура"), 
			"ВидАлкогольнойПродукции");
			
	Ошибки = Новый Массив;
	Для Каждого Товар Из Товары Цикл
		Если ВидАлкогольнойПродукцииНомеклатуры[Товар.Номенклатура] <> ВидАлкогольнойПродукции Тогда
			Ошибки.Добавить(Товар.НомерСтроки);
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого Ошибка Из Ошибки Цикл
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(
				НСтр("ru = 'В строке %1 вид алгокольной продукции (%2) отличается от указанной в документе (%3)'"),
				Ошибка,
				ВидАлкогольнойПродукцииНомеклатуры[Товары[Ошибка-1].Номенклатура],
				ВидАлкогольнойПродукции),
			ЭтотОбъект,
			"Товары",,        
			Отказ);
	КонецЦикла;	
	
КонецПроцедуры	
	
Процедура ПроверитьУникальностьВидаМаркиТипаАлкогольнойПродукции(Отказ)
	
	Номенклатура = Товары.Выгрузить(, "Номенклатура");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Товары.Выгрузить(, "Номенклатура"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.бг_ТипМарки КАК ТипМарки,
	|	Номенклатура.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&Номенклатура)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипМарки,
	|	ВидАлкогольнойПродукции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.ТипМарки КАК ТипМарки,
	|	Номенклатура.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции
	|ПОМЕСТИТЬ ВТДубли
	|ИЗ
	|	ВТНоменклатура КАК Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура.ТипМарки,
	|	Номенклатура.ВидАлкогольнойПродукции
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипМарки,
	|	ВидАлкогольнойПродукции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Дубли.ТипМарки КАК ТипМарки,
	|	Дубли.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	ПРЕДСТАВЛЕНИЕ(Дубли.ТипМарки) КАК ПредставлениеМарки,
	|	ПРЕДСТАВЛЕНИЕ(Дубли.ВидАлкогольнойПродукции) КАК ПредставлениеВидаПродукции,
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	ВТДубли КАК Дубли
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНоменклатура КАК Номенклатура
	|		ПО Дубли.ТипМарки = Номенклатура.ТипМарки
	|			И Дубли.ВидАлкогольнойПродукции = Номенклатура.ВидАлкогольнойПродукции
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дубли.ТипМарки.Представление,
	|	Дубли.ВидАлкогольнойПродукции.Представление";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиНоменклатуры = Товары.Выгрузить(, "Номенклатура, НомерСтроки");
	СтрокиНоменклатуры.Индексы.Добавить("Номенклатура");
	ПоискНоменклатуры = Новый Структура("Номенклатура");
	
	Повторы = Новый Массив;
	СтрокиДублей = Новый ТаблицаЗначений;
	СтрокиДублей.Колонки.Добавить("НомерСтроки");
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("ТипМарки") Цикл
		ПредставлениеТипаМарки     = Выборка.ПредставлениеМарки;
		Пока Выборка.СледующийПоЗначениюПоля("ВидАлкогольнойПродукции") Цикл
			ПредставлениеВидаПродукции = Выборка.ПредставлениеВидаПродукции;
			Пока Выборка.Следующий() Цикл
				ПоискНоменклатуры.Номенклатура = Выборка.Номенклатура;
				Для Каждого СтрокаНоменклатуры Из СтрокиНоменклатуры.НайтиСтроки(ПоискНоменклатуры) Цикл
					ЗаполнитьЗначенияСвойств(СтрокиДублей.Добавить(), СтрокаНоменклатуры); 
				КонецЦикла;	
			КонецЦикла;	
			СтрокиДублей.Сортировать("НомерСтроки");
			Повторы.Добавить(
				СтрШаблон(
					"%1 и %2 в строках %3",
					ПредставлениеТипаМарки,
					ПредставлениеВидаПродукции,
					СтрСоединить(СтрокиДублей.ВыгрузитьКолонку("НомерСтроки"), ", ")));
			СтрокиДублей.Очистить();	
		КонецЦикла;	
	КонецЦикла;	
	
	ОбщегоНазначения.СообщитьПользователю(
		СтрШаблон(
			"Совпадают типы марок и виды алкогольной продукции:
			|%1
			|Оформите разными заявлениями.",
			СтрСоединить(Повторы, Символы.ПС)),
		ЭтотОбъект,
		"Товары",,        
		Отказ);
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
